Revit 2023 API
FabricationHostedInfo Properties
The FabricationHostedInfo type exposes the following members.
Properties
Name | Description
HostId
 Returns the Id of the host.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace